# ===================================================
# Flaskの設定
# ===================================================
class Config(object):
    # ---------------------------------------
    # デバックモード
    # ---------------------------------------
    DEBUG = True

    # ---------------------------------------
    # 警告対策
    # ---------------------------------------
    SQLALCHEMY_TRACK_MODIFICATIONS = False

    # ---------------------------------------
    # セッションの永続化設定
    # セッションをファイルに保存
    # ---------------------------------------
    SESSION_PERMANENT = True
    SESSION_TYPE = "filesystem"

    # ---------------------------------------
    # DB設定
    # シークレットキー
    # ---------------------------------------
    SQLALCHEMY_DATABASE_URI = "sqlite:///gifushinbun_coupon_access.sqlite"
    SECRET_KEY = "as09dsfasoijenf"
